app/controllers/companies_controller.rb

  def show
    @company = Company.find(params[:id])
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 2)

  def edit
    @company = Company.find(params[:id])
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 2)

  def update
    @company = Company.find(params[:id])
    contacts_to_assign = params[:contacts][:ids] rescue []

    if @company.update_attributes(params[:company])
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 2)
UPDATE `companies` SET `address_line_2` = '', `updated_at` = '2009-06-10 19:18:48' WHERE `id` = 2