app/controllers/contacts_controller.rb

  def index
    conditions = params[:query].blank? ? nil : ['first_name LIKE ? OR last_name LIKE ?', "%#{params[:query]}%", "%#{params[:query]}%"]
    @contacts = Contact.find_all_contacts_pagination(params[:page], conditions)
---
SELECT * FROM `contacts` WHERE (first_name LIKE '%le%' OR last_name LIKE '%le%') ORDER BY first_name ASC LIMIT 0, 5

  def create
    @contact = Contact.new(params[:contact])

    if @contact.save
---
INSERT INTO `contacts` (`photo_file_name`, `photo_file_size`, `updated_at`, `photo_content_type`, `phone`, `company_id`, `first_name`, `last_name`, `email`, `created_at`) VALUES(NULL, NULL, '2009-06-10 18:35:48', NULL, '', NULL, 'Sonny', 'Le', 'sonny.le@email.com', '2009-06-10 18:35:48')

  def show
    @contact = Contact.find(params[:id])
---
SELECT * FROM `contacts` WHERE (`contacts`.`id` = 1)

  def edit
    @contact = Contact.find(params[:id])
---
SELECT * FROM `contacts` WHERE (`contacts`.`id` = 2)

  def update
    @contact = Contact.find(params[:id])

    if @contact.update_attributes(params[:contact])
---
SELECT * FROM `contacts` WHERE (`contacts`.`id` = 2)
UPDATE `contacts` SET `photo_content_type` = 'image/jpeg', `updated_at` = '2009-06-10 19:23:52', `photo_file_size` = 4755, `photo_file_name` = 'sonny.jpg' WHERE `id` = 1